src/Catalogs/гф_НастройкиПечатиСвойствЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_НастройкиПечатиСвойствЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/гф_НастройкиПечатиСвойствЭтикеток/Forms/гф_ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьРеквизиты(Команда)
	СпискиРеквизитов = ВыбратьРеквизитыНаСервере();
	
	СписокРеквизитов = СпискиРеквизитов["СписокРеквизитов"];
	СписокОтмеченных = СпискиРеквизитов["СписокОтмеченных"];
	ТипРеквизит = 
	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отмеченные", СписокОтмеченных);
	ПараметрыФормы.Вставить("ЗначенияДляВыбора", СписокРеквизитов);
	ПараметрыФормы.Вставить("ЗначенияДляВыбораЗаполнены", Истина);
	ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями", Истина);
	ПараметрыФормы.Вставить("БыстрыйВыбор", Ложь);
	ПараметрыФормы.Вставить("Представление", НСтр("ru = 'Реквизиты для печати'"));
	ПараметрыФормы.Вставить("ОписаниеТипов", ТипРеквизит);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораРеквизитов", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, , , , Обработчик, Режим);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСвойства(Команда)
	
	СпискиДляВыбора = ПолучитьСписокСвойствНаСервере();
	СписокСвойств = СпискиДляВыбора["СписокСвойств"];
	СписокОтмеченных = СпискиДляВыбора["СписокОтмеченных"];
	ТипДопСведения = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отмеченные", СписокОтмеченных);
	ПараметрыФормы.Вставить("ЗначенияДляВыбора", СписокСвойств);
	ПараметрыФормы.Вставить("ЗначенияДляВыбораЗаполнены", Истина);
	ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями", Истина);
	ПараметрыФормы.Вставить("БыстрыйВыбор", Ложь);
	ПараметрыФормы.Вставить("Представление", НСтр("ru = 'Свойства для печати'"));
	ПараметрыФормы.Вставить("ОписаниеТипов", типДопСведения);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораСвойств", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, , , , Обработчик, Режим);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокСвойствНаСервере()
	ЗначенияСвойств = Новый ТаблицаЗначений;
	ЗначенияСвойств.Колонки.Добавить("Свойство");
	ЗначенияСвойств.Колонки.Добавить("Значение");
	ДоступныеНаборыСвойств = Новый СписокЗначений;
	СсылкаНом = Справочники.Номенклатура.ПустаяСсылка();
	
	НаборыСвойств = УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(СсылкаНом);
	Для каждого Строка Из НаборыСвойств Цикл
		ДоступныеНаборыСвойств.Добавить(Строка.Набор);
	КонецЦикла;
	
	Таблица = УправлениеСвойствамиСлужебный.ЗначенияСвойств(
		ЗначенияСвойств, ДоступныеНаборыСвойств, Истина);
	СписокСвойств = Новый СписокЗначений;
	СписокСвойств.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("Свойство"));
	СписокСвойств.СортироватьПоЗначению();
	тзДополнительныеСведения = Объект.ДополнительныеСведения.Выгрузить();
	СписокОтмеченных = Новый СписокЗначений;
	СписокОтмеченных.ЗагрузитьЗначения(тзДополнительныеСведения.ВыгрузитьКолонку("Свойство"));
	
	СпискиДляВыбора = Новый Структура("СписокСвойств, СписокОтмеченных", СписокСвойств, СписокОтмеченных);
		
	Возврат СпискиДляВыбора;
		
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСвойств(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	Иначе
		ЗаполнитьДополнительныеСведения(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеСведения(РезультатВыбора)

	//Объект.ДополнительныеСведения.Очистить(); // Галфинд_Домнышева_24_04_2023
	Для каждого ЭлСз Из РезультатВыбора Цикл
		Если ЭлСз["Пометка"] Тогда
			нс = Объект.ДополнительныеСведения.Добавить();
			нс["Свойство"] = ЭлСз["Значение"];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВыбратьРеквизитыНаСервере()
	СписокРеквизитов = Новый СписокЗначений;
	Для каждого Реквизит Из Метаданные.Справочники.Номенклатура.Реквизиты Цикл
		// ++ Галфинд_Домнышева_24_04_2023
		// e1cib/data/Задача.ЗадачаИсполнителя?ref=8132bcee7bda45d711edda03fa53bd76
		Если Реквизит.Имя = "ПроизводительИмпортерКонтрагент" Тогда
			 СписокРеквизитов.Добавить("Производитель (импортер)");
		Иначе
		// -- Галфинд_Домнышева_24_04_2023	 
		СписокРеквизитов.Добавить(Реквизит.Синоним);// Переделала на синоним Домнышева_19_04_2023 
		КонецЕсли;
	КонецЦикла;
	СписокРеквизитов.СортироватьПоЗначению();
	тзРеквизиты = Объект.Реквизиты.Выгрузить();
	СписокОтмеченных = Новый СписокЗначений;
	СписокОтмеченных.ЗагрузитьЗначения(тзРеквизиты.ВыгрузитьКолонку("Реквизит"));
	
	СпискиДляВыбора = Новый Структура("СписокРеквизитов, СписокОтмеченных", СписокРеквизитов, СписокОтмеченных);
		
	Возврат СпискиДляВыбора;
		
КонецФункции

&НаКлиенте
Процедура ПослеВыбораРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	Иначе
		ЗаполнитьРеквизиты(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизиты(РезультатВыбора)

	//Объект.Реквизиты.Очистить(); // Галфинд_Домнышева_24_04_2023
	Для каждого ЭлСз Из РезультатВыбора Цикл
		Если ЭлСз["Пометка"] Тогда
			нс = Объект.Реквизиты.Добавить();
			нс["Реквизит"] = ЭлСз["Значение"];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗначенийТипов = Новый Массив;
	
	СписокЗначенийТипов.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	СписокЗначенийТипов.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	
	Элементы.ТипАдреса.СписокВыбора.ЗагрузитьЗначения(СписокЗначенийТипов);
	Элементы.ТипАдреса.КнопкаСоздания = Ложь;
	
КонецПроцедуры

#КонецОбласти
